{
"keywords":"jQuery plugin,ready-made shapes,shapefly plugins,wordpress plugin, tinyMCE plugin",
"description":"Plugin of shapefly.How to import this plugin to your website.",
"title":"Plugin &middot; Shapefly",
"heading":"Plugin",
"lead":"Bring shapefly to your life.Lets users drawing ready-made shapes on your website straight-through.",
"tinymce":"true",
"content":"Please insert a flowchart.",
"h11_heading":"Shapefly plugin on <abbr title=\"What you see is what you get.\" class=\"initialism\">WYSIWYG</abbr> editor",
"h11_summary":"Suppose you are using the following editor on your website.You want to insert a flowchart here right now.Then you click the button<img src=\"/favicon.ico\" width=\"16\" height=\"16\"/> on the toolbar above, then it will redirect to shapefly.com service for you to draw something and insert to the editor after finish.",
"h12_heading":"How it work",
"h12_summary":"As you know from the sample above, the plugin just redirect you to open <code>shapefly.com/editor</code>, all your drawing was on shapefly.com service, and it just return a image to your website after finish.Furthermore, if you want to change your drawing, you can select the image, then also click the plugin button.It redirects you to <code>shapefly.com/editor</code> for changing your drawing of the image.So don't forget to save your drawing on shapefly service after finish.",
"h13_heading":"How to use",
"h13_summary":"The following is the plugins for different scenarios, you can select a suitable one.",
"h131_heading":"Independent javascript",
"h131_summary":"The <a href=\"https://github.com/zzzhan/shapefly-plugin\">shapefly-plugin</a> is a independent javascript liberary, which only includes two files <code>shapefly-plugin.js</code> and <code>shapefly-plugin.html</code>.For the security of cross-domain, you have to copy them to your owner website before using it.Then the following is really all you need to get going.",
"h132_heading":"Plugin for tinyMCE",
"h132_summary":"The <a href=\"https://github.com/zzzhan/tinymce-plugin-shapefly\">tinymce-plugin-shapefly</a> is a <a href=\"https://github.com/tinymce\">tinyMCE</a> plugin, which is a button on tinyMCE toolbar.Config the tinymce simply with the name <code>shapefly</code>.It is built base on the <code>shapefly-plugin</code>.See the following to learn about the config on tinyMCE.",
"h133_heading":"Plugin for WordPress",
"h133_summary":"The <a href=\"https://github.com/zzzhan/wp-tinymce-plugin-shapefly\">wp-tinymce-plugin-shapefly</a> is a WordPress plugin, which is built base on <code>tinymce-plugin-shapefly</code>.You can download from <a href=\"#\">here</a>, then install it to your WordPress.",
"install_with_bower":"Or install with bower",
"h14_heading":"Support",
"h14_summary":"Any problem, please feel free to contact us.",
"detail-btn":"Learn more &raquo;"
}